app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sdfsdfq"], ["body", "sfsdfdsfsdf"], ["created_at", "2022-04-01 17:07:31.469444"], ["updated_at", "2022-04-01 17:07:31.469444"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save